#include <stdio.h>

void main() {
    /*
        11. 진법변환
        - 2진수를 8진수 or 16진수 변환
        ex) 19를 2진수로
        32 16 8 4 2 1
        0  1  0 0 1 1
        - 8진수
        4 2 1 / 4 2 1
        0 1 0 / 0 1 1
        -> 23
        - 16진수
        8 4 2 1 / 8 4 2 1
        0 0 0 1 / 0 0 1 1
        -> 13

        12. 비트연산자
        - &, |, ^, ~, >>, <<
        
    */

    printf("%d\n", 5&3); // AND : 둘다 참이면 1
    printf("%d\n", 5|3); // OR : 하나만 참이어도 1
    printf("%d\n", 5^3); // XOR : 다르면 1, 같으면 0
    printf("%d\n", ~5);
    printf("%d\n", ~-5); // NOT : 1더하고 부호바꾸기
    printf("=============================\n");

    int x = 0x11;
    int y, z;
    y = x & 0x0f;
    z = x | 0x0f;
    printf("%d, %d, %d", x, y, z);
}
